{
    "2": {
        "id": "673fbc36a1ecc",
        "nome": "rede",
        "descricao": "Projeto: Sistema de Cadastro e Consulta de Produtos (sem banco de dados)\r\nDescrição do Projeto\r\nDesenvolver um sistema em PHP para gerenciar um catálogo de produtos. O sistema permitirá:\r\n1. Cadastrar produtos: Nome, descrição, preço e quantidade.\r\n2. Listar produtos cadastrados: Exibir todos os produtos já cadastrados em uma tabela.\r\n3. Pesquisar produtos: Permitir a pesquisa de produtos pelo nome.\r\n4. Excluir produtos: Oferecer a funcionalidade para excluir produtos cadastrados.\r\n5. Editar produtos: Permitir que os produtos cadastrados sejam editados.\r\nO sistema deverá ser simples, mas funcional, e utilizar arquivos na pasta do projeto para armazenar \r\nos dados (ex.: arquivos .txt ou .json).\r\nRequisitos Funcionais\r\n1. Interface amigável, com formulários para:\r\n• Cadastrar produtos.\r\n• Buscar produtos pelo nome.\r\n• Editar ou excluir produtos da lista.\r\n2. Salvar os dados de produtos em arquivos no servidor.\r\n3. As alterações realizadas no sistema devem refletir no arquivo de dados em tempo real.\r\n4. Implementar validações básicas:\r\n• Todos os campos do formulário de cadastro devem ser obrigatórios.\r\n• O preço deve ser numérico e positivo.\r\n• A quantidade deve ser um número inteiro positivo.\r\nRequisitos Não Funcionais\r\n1. O sistema deverá ser desenvolvido sem banco de dados ou cookies.\r\n2. Utilize apenas PHP, HTML e CSS (opcionalmente JavaScript para melhorar a experiência do\r\nusuário).\r\n3. Deve ser possível rodar o sistema localmente, utilizando apenas um servidor local como o \r\nXAMPP.\r\nEntregáveis\r\n1. Código-fonte completo do sistema.\r\n2. Instruções para rodar o sistema localmente (README.txt ou README.md).",
        "preco": 34,
        "quantidade": 1
    },
    "3": {
        "id": "673fc226c575c",
        "nome": "copo",
        "descricao": "jjjjjjjjjjjjjjjjjjjj",
        "preco": 90,
        "quantidade": 7
    },
    "4": {
        "id": "673fc25234642",
        "nome": "copo",
        "descricao": "jjjjjjjjjjjjjjjjjjjj",
        "preco": 90,
        "quantidade": 7
    },
    "5": {
        "id": "673fc264d41c9",
        "nome": "copo",
        "descricao": "jjjjjjjjjjjjjjjjjjjj",
        "preco": 90,
        "quantidade": 7
    }
}